{
  "blogs": [
    {
      "title": "Chelsea still not hitting top gear",
      "body": "Chelsea beat Porto 2-0 in the away leg of their Champions League quarter final in Seville last night, but they never looked quite as comfortable as that final score suggests. There were moments of real defensive quality, some nice passages in midfield, and a couple of brilliant touches in attack, but ultimately it was a tense match where their attacking game was largely ineffective. None of the starting front three saw much of the ball in the first half, and Olivier Giroud didn’t fare much better when he came on after the break. Neither Kai Havertz as a false 9 nor Giroud as a proper one had much luck linking up with their teammates, even as the game got more stretched. Mateo Kovacic and Jorginho ended up with solid performances to look back on, but neither could say they were fully comfortable for most of the 90 minutes, and the back three and goalkeeper were nervy in moving the ball forwards. Speaking after the game, Thomas Tuchel admitted that he hadn’t seen the fluent attacking performance he was hoping for: “I accept that it was a tough match for Timo and for Kai today, they did not have their best day and we did not deliver so good, the connection between the deep seven players that we needed for the build-up and the front three, we lost a bit the connection to them,” Tuchel confessed at full time. “To have a bit more of an impact, the balls we delivered were not the best balls. I could feel our two German players up front, Kai and Timo, do not play on their highest level today so I wanted to have an impact from the bench,” the coach continued. There was one raking pass in behind which Reece James whipped left-footed from deep on the right-hand side which Werner almost got on the end of, but apart from that there were few attempts to hit the attacking players early. All too often Kovacic and Jorginho were unable to find space to receive the ball in, and time and again they were forced backwards and sideways. James and Ben Chilwell provided much more threat out wide, and in the end the latter got the second goal. But there was a reluctance at times to play the risky long passes into the pair that could release them. Porto are a tricky team, and they made that clear last night, but there’s no doubt we’re still left wanting more by the attacking play we see week-to-week at the moment. There are a lot of players competing for places, and few are truly convincing at the moment. We’ve seen so much better from them before, and if just a couple can get up to speed this side would be really dangerous. Tammy Abraham and Callum Hudson-Odoi surely have to be given further chances to add some chemistry and goals to a rotating cast that still sometimes struggle to click. The Kai Havertz as a striker experience must also be near to its conclusion for now. It’s another super result to add to the growing collection for Thomas Tuchel, but he knows as well as the rest of us that there is plenty more potential to unlock in this team.",
      "author": "Alex",
      "id": 1
    },
    {
      "title": "East London venue Colour Factory to open new outdoor space, Colour Garden",
      "body": "The 300-capacity area will host weekly seated events from Friday, April 16th. Young East London venue Colour Factory is opening a new outdoor area on the same site. Formerly Mick's Garage, the multi-purpose spot sits in Queen's Yard, Hackney Wick. Though the indoor space can't open until at least June 21st in accordance with current Covid-19 regulations, warm-up events will run from next Friday, April 16th, at Colour Garden, the venue's 300-capacity outdoor area. A two-month programme has been revealed, with DJ slots for DEBONAIR, OK Williams, Alexander Nut, Sicaria Sound, Flo Dill, Andrew Ashong, James Massiah, Errol, Ikonika and more. Colour Garden has been fitted with a Martin Audio soundsystem. 'We are the only large Black-owned music venue in East London,' says director Nathanael Williams. 'We are committed to representing and reflecting the diverse community of London, and so every single one of our in-house lineups will always incorporate at least one person of colour and will always be mixed gender.' As of Monday, April 12th, pubs, bars and restaurants can serve food and drinks outdoors. Guests must be seated with no more than six people (or two households) per table. This is Stage 2 of the government's latest roadmap.",
      "author": "Alex",
      "id": 2
    },
    {
      "title": "Jumped By An Adult Puma In The Bolivian Jungle",
      "body": "Cheap, Bolivian vodka. That’s what got me there. Isolated, deep in the Bolivian jungle, with an apex predator wrapped around my body (and hot breath on my face). Volunteering at a Bolivian animal sanctuary I saw all kinds of monkey bites and scratches. It was common for backpackers to show off their fresh wounds at the end of each day. But no one had a story like this… The weekly volunteer party got out of hand (the night before). Those with the appropriate big-animal training didn’t wake up or sign in to the morning’s meeting. I was there. Hungover, but there.  So, I agreed to help out with the puma (even though it normally requires months of training and animal integration/familiarity). After an hour of trekking through the jungle, one of the team members and I reached the puma’s enclosure. The huge cat growled at me with a distinct sense of dislike. But that didn’t stop us from continuing our task. We entered the caged area, attached two ropes to the puma’s “collar” and begun to walk him through the jungle. The puma, completely unpleased with my intrusion, stepped forward hesitantly. After only a couple of minutes, he stopped, looked back at me and growled directly into my eyes. I watched helplessly as the puma leaped 10ft into the air towards me. In a split-second, his powerful legs wrapped around my waist, arms wrapped around my throat and fangs pressed into my forehead. I heard my team member scream. But I couldn’t move. Completely still, I assumed the worst. Yet, somehow it felt completely natural. The circle of life. The scream faded as I began to lose consciousness. Then, all of a sudden, I was released. The animal let me go and stepped backwards. After swearing profusely, my team member yelled “stick your palm out towards him”. For some reason, I did.  The huge cat stepped back towards me and licked it. And, that was it. He knew that I knew, who was king of the jungle. After that we were friends. Volunteering with animals is a great way to give back while you eco travel. Just be sure to pick places with adequate training if you don’t want to have bad travel stories like mine!",
      "author": "Alex",
      "id": 3
    }
  ]
}